ПРОВЕРКА СИНТАКСИСА КОМАНД

Когда команда отправляется нажатием клавиши **Enter**, интерпретатор командной строки анализирует команду слева направо, чтобы определить, какое действие запрашивается. Обычно **IOS** обеспечивает только отрицательную обратную связь, если что-то было введено неверно. Если интерпретатор не может понять введенную команду, он предоставит информацию о том, что не так с командой.

---

**Двойственная команда (Ambiguous command)** – введено недостаточно символов для, чтобы система распознала команду.

Switch# c
% Ambiguous command:’c’

---

**Неполная команда (Incomplete command)** – не все необходимые ключевые слова или аргументы были введены.

Switch# clock set
% Incomplete command.

---

**Неверная команда (Invalid input)** – команда введена некорректно. Ошибка произошла в месте, на которое указывает маркер

Switch#clok set 13:30:00 21 February 2018 ^
%Invalid input detected at ‘^’ marker.

---

### ГОРЯЧИЕ КЛАВИШИ И СОЧЕТАНИЯ КЛАВИШ

В **CLI IOS** есть возможность использовать горячие клавиши и сочетания клавиш, которые облегчают использование системы. Рассмотрим наиболее полезные из них:

- **Стрелка вниз** - позволяет прокручивать строку вперед по введенным командам
- **Стрелка вверх** – Позволяет прокручивать строку назад по введенным командам
- **Tab** - завершает оставшуюся часть частично введенной команды или ключевого слова
- **Ctrl-A** - переход к началу строки
- **Ctrl-E** - перемещение в конец строки
- **Ctrl-R** – повторное отображение строки
- **Ctrl-Z** - Выход из режима конфигурации и возврат к User EXEC
- **Ctrl-C** - выход из режима конфигурации или прерывание текущей команды
- **Ctrl-Shift-6** - Позволяет пользователю прерывать процесс IOS, такой как ping или traceroute

Рассмотрим их подробнее.

---

**Tab**

Клавиша **Tab** используется для завершения оставшейся части сокращенной команды и параметра, если аббревиатура содержит достаточно букв, чтобы отличаться от любых других доступных в данный момент команд или параметров. Когда для ввода уникальной команды или ключевого слова было введено достаточно символов, нужно нажать **Tab**, и CLI отобразит остальную часть команды или ключевого слова.

---

**Ctrl-R**

Повторное отображение строки обновит только что напечатанную строку. Например, IOS может отобразить сообщение в CLI во время набора команды пользователем. **Ctrl-R** можно использовать для обновления строки и избегать повторного ее ввода.

---

**Ctrl-Z**

Выход из режима конфигурации выйдет из любого режима конфигурации и вернется в привилегированный режим EXEC. Поскольку IOS имеет иерархическую структуру, вместо того, чтобы выходить из каждого подрежима отдельно, можно использовать **Ctrl-Z**, привилегированный режим EXEC.

---

**Стрелки вверх и вниз**

При помощи стрелок можно отображать историю введенных команд. Cisco IOS выполняет буферизацию нескольких прошлых команд и символов, чтобы записи могли быть снова отображены. Буфер полезен для повторного ввода команд без повторного набора.

---

**Ctrl-Shift-6**

Эта последовательность прерывает любой выполняющийся процесс. Когда процесс **IOS** инициируется из CLI, например, **ping** или **traceroute**, команда работает до тех пор, пока не будет завершена или не будет прервана. Пока процесс выполняется, CLI не отвечает. Чтобы прервать вывод и взаимодействовать с CLI, нужно нажать **Ctrl-Shift-6**.

---

**Ctrl-C**

Прерывает ввод команды и выходит из режима конфигурации. Это может быть полезно после ввода команды, которая должна быть отменена.

---

**Сокращенные команды или ключевые слова**

Команды и ключевые слова могут быть сокращены до минимального количества символов, которые идентифицируют уникальный выбор. Например, команда **configure** может быть сокращена до **conf**, поскольку **configure** является единственной командой, которая начинается с **conf**. Аббревиатура **con** не будет работать, потому что более чем одна команда начинается с **con**. Ключевые слова также могут быть сокращены.

Пример:

Switch# show interfaces
Switch# sh int

## Сохранение конфигурации

Конфигурация вашей сети Cisco хранится в двух основных местах: одно находится в ОЗУ, а другое - в текущей конфигурации (**running configuration**). Когда вы вводите команды, они активируются немедленно и сохраняются в текущей конфигурации, которая хранится в ОЗУ.  

Поэтому при выключении питания конфигурация теряется. Чтобы сохранить эту конфигурацию, скопируйте ее в загрузочную конфигурацию (**startup-configuration**), что означает, что она хранится в энергонезависимой ОЗУ (NVRAM), чтобы конфигурация сохранялась при выключении питания.

Вы можете использовать две команды для сохранения вашей конфигурации: команду записи или команду копирования. Команда записи устарела, но будет выглядеть так:

Router#write memory
Building configuration...
[OK]	

Более новая версия команды - это команда копирования, которая выглядит как:

Router#copy running-config startup-config
Destination filename [startup-config]?
Building configuration...
[OK]

Команда копирования предлагает больше гибкости и возможностей. Вы можете не только скопировать данные текущей конфигурации в файл начальной конфигурации, но и скопировать их в файл на флэш-памяти или на TFTP-сервер в вашей сети.

Для любой команды вам нужно набрать столько букв, сколько требуется IOS для однозначной идентификации команды. Например:

copy run sta